read_verilog cpu.v alu.v regfile.v control.v imm_gen.v 
synth_xilinx -top cpu
write_verilog cpu_synth.v
